lkolbly/cmsis-svd/data/NXP/LPC55S26.svd
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DIGEST0[%s]</name>
          <description>no description available</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIGEST</name>
              <description>One word of the Digest or output. Note that only 1st 4 are populated for AES and 1st 5 are populated for SHA1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRYPTCFG</name>
          <description>Crypto settings for AES and Salsa and ChaCha</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xF31FFF</resetMask>
          <fields>
            <field>
              <name>MSW1ST_OUT</name>
              <description>If 1, OUTDATA0 will be read Most significant word 1st for AES. Else it will be read in normal little endian - Least significant word 1st. Note: only if allowed by configuration.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWAPKEY</name>
              <description>If 1, will Swap the key input (bytes in each word).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWAPDAT</name>
              <description>If 1, will SWAP the data and IV inputs (bytes in each word).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSW1ST</name>
              <description>If 1, load of key, IV, and data is MSW 1st for AES. Else, the words are little endian. Note: only if allowed by configuration.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESMODE</name>
              <description>AES Cipher mode to use if plain AES</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECB</name>
                  <description>ECB - used as is</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBC</name>
                  <description>CBC mode (see details on IV/nonce)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTR</name>
                  <description>CTR mode (see details on IV/nonce). See also AESCTRPOS.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESDECRYPT</name>
              <description>AES ECB direction. Only encryption used if CTR mode or manual modes such as CFB</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENCRYPT</name>
                  <description>Encrypt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECRYPT</name>
                  <description>Decrypt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESSECRET</name>
              <description>Selects the Hidden Secret key vs. User key, if provided. If security levels are used, only the highest level is permitted to select this.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_WAY</name>
                  <description>User key provided in normal way</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIDDEN_WAY</name>
                  <description>Secret key provided in hidden way by HW</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESKEYSZ</name>
              <description>Sets the AES key size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BITS_128</name>
                  <description>128 bit key</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BITS_192</name>
                  <description>192 bit key</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BITS_256</name>
                  <description>256 bit key</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESCTRPOS</name>
              <description>Halfword position of 16b counter in IV if AESMODE is CTR (position is fixed for Salsa and ChaCha). Only supports 16b counter, so application must control any additional bytes if using more. The 16-bit counter is read from the IV and incremented by 1 each time. Any other use CTR should use ECB directly and do its own XOR and so on.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STREAMLAST</name>
              <description>Is 1 if last stream block. If not 1, then the engine will compute the next &quot;hash&quot;.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICBSZ</name>
              <description>This sets the ICB size between 32 and 128 bits, using the following rules. Note that the counter is assumed to occupy the low order bits of the IV.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BITS_32</name>
                  <description>32 bits of the IV/ctr are used (from 127:96)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BITS_64</name>
                  <description>64 bits of the IV/ctr are used (from 127:64)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BITS_96</name>
                  <description>96 bits of the IV/ctr are used (from 127:32)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT_128</name>
                  <description>All 128 bits of the IV/ctr are used</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICBSTRM</name>
              <description>The size of the ICB-AES stream that can be pushed before needing to compute a new IV/ctr (counter start). This optimizes the performance of the stream of blocks after the 1st.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKS_8</name>
                  <description>8 blocks</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLOCKS_16</name>
                  <description>16 blocks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLOCKS_32</name>
                  <description>32 blocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLOCKS_64</name>
                  <description>64 blocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG</name>
          <description>Returns the configuration of this block in this chip - indicates what services are available.</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DUAL</name>
              <description>1 if 2 x 512 bit buffers, 0 if only 1 x 512 bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA</name>
              <description>1 if DMA is connected</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB</name>
              <description>1 if AHB Master is enabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AES</name>
              <description>1 if AES 128 included</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AESKEY</name>
              <description>1 if AES 192 and 256 also included</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECRET</name>
              <description>1 if AES Secret key available</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICB</name>
              <description>1 if ICB over AES included</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK</name>
          <description>Lock register allows locking to the current security level or unlocking by the lock holding level.</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFF3</resetMask>
          <fields>
            <field>
              <name>SECLOCK</name>
              <description>Write 1 to secure-lock this block (if running in a security state). Write 0 to unlock. If locked already, may only write if at same or higher security level as lock. Reads as: 0 if unlocked, else 1, 2, 3 to indicate security level it is locked at. NOTE: this and ID are the only readable registers if locked and current state is lower than lock level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCK</name>
                  <description>Unlocks, so block is open to all. But, AHB Master will only issue non-secure requests.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK</name>
                  <description>Locks to the current security level. AHB Master will issue requests at this level.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PATTERN</name>
              <description>Must write 0xA75 to change lock state. A75:Pattern needed to change bits 1:0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>MASK[%s]</name>
          <description>no description available</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>MASK</name>
              <description>A random word.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
